app/views/users/show.html.erb

<tr><th>phone</th><td><%=@user.phone %></td></tr>
<tr><th><%=link_to '#rentals', rentals_path(:search => @user.name) %></th><td><%=@user.rentals.count%></td></tr>
---
SELECT COUNT(*) FROM `gs3_rentals` WHERE `gs3_rentals`.`user_id` = 1851
SELECT `gs3_rentals`.* FROM `gs3_rentals` WHERE `gs3_rentals`.`user_id` = 1851

<h3>Notes</h3>
<% if @user.user_notes.size == 0 %>
---
SELECT COUNT(*) FROM `gs3_user_notes` WHERE `gs3_user_notes`.`user_id` = 1851
SELECT `gs3_user_notes`.* FROM `gs3_user_notes` WHERE `gs3_user_notes`.`user_id` = 1046