app/views/rentals/index.html.erb

	<td><%=r.approver.name %></td>
	<td><%=r.rental_items.count %></td>
---
SELECT COUNT(*) FROM `gs3_rental_items` WHERE `gs3_rental_items`.`rental_id` = 68
SELECT `gs3_rental_items`.* FROM `gs3_rental_items` WHERE `gs3_rental_items`.`rental_id` = 123