app/views/rentals/show.html.erb

SELECT `gs3_rental_items`.* FROM `gs3_rental_items` WHERE `gs3_rental_items`.`rental_id` = 88
---
<thead><tr><th>type</th><th>identifier</th><th>description</th><th>returned</th><th>missing</th><th>note</th><th>update date</th><th>approver</th></tr></thead>
<% @rental.rental_items.each do |i| %>