app/views/ledgers/index.html.erb

  <tr>
  <% Ledger.types.each do |type| %>
---
SELECT `gs3_ledgers`.* FROM `gs3_ledgers` WHERE (created_at >= '2013-07-16 14:00:00' and created_at <= '2013-07-17 00:05:38')