app/controllers/gear_items_controller.rb

	def index
		@type = params[:type]
		if params[:type]
			@gear_items = GearItem.find_all_by_gear_item_type_id(params[:type])
			@label = 'Inventory'
		elsif params[:missing]
			@gear_items = GearItem.find_all_by_missing(true)
			@label = 'Missing inventory'
		elsif params[:rented]
			@gear_items = GearItem.find_all_by_rented(true)
			@label = 'Rented inventory'
		elsif params[:overdue]
			@gear_items = GearItem.overdue
			@label = 'Overdue inventory'
    elsif params[:retired]
      @gear_items = GearItem.retired
      @label = 'Retired inventory'
		else
			@gear_items = GearItem.all
---
SELECT `gs3_gear_items`.* FROM `gs3_gear_items` WHERE `gs3_gear_items`.`retired` IS NULL

	def update
		@gear_item = GearItem.find(params[:id])
		@gear_item.update_attributes params[:gear_item]
---
UPDATE `gs3_gear_items` SET `missing` = 0, `updated_at` = '2013-07-16 23:51:50' WHERE `gs3_gear_items`.`id` = 179