app/controllers/gear_item_notes_controller.rb

	def create
		gin = GearItemNote.create(params[:gear_item_note])
---
INSERT INTO `gs3_gear_item_notes` (`approver_id`, `created_at`, `gear_item_id`, `note`, `rental_item_id`, `updated_at`) VALUES (1851, '2013-07-16 23:53:06', 797, 'foobar', NULL, '2013-07-16 23:53:06')