app/controllers/ledgers_controller.rb

INSERT INTO `gs3_ledgers` (`amount`, `approver_id`, `created_at`, `description`, `rental_id`, `updated_at`, `user_id`) VALUES (20, 1851, '2013-07-17 00:05:48', 'sales', NULL, '2013-07-17 00:05:48', NULL)
---
  def create
    @entry = Ledger.new(params[:ledger])
    if params[:reconcile]
      @entry.amount = @entry.amount - Ledger.balance_until(Time.now)
      @entry.description = 'reconcile: ' + @entry.description
    end
    @entry.save

SELECT `gs3_ledgers`.* FROM `gs3_ledgers` WHERE (created_at >= '2013-07-16 14:00:00' and created_at <= '2013-07-17 00:05:38')
---
	def index
		@from = Time.now.beginning_of_day
		@to = Time.now

		@from = params[:from] if params[:from]
		@to = params[:to] if params[:to]

		@balance = Ledger.balance_until(@from)
		@entries = Ledger.where("created_at >= ? and created_at <= ?", @from, @to)