app/controllers/rentals_controller.rb

SELECT `gs3_users`.* FROM `gs3_users` WHERE `gs3_users`.`id` = 1851 LIMIT 1
SELECT `gs3_rentals`.* FROM `gs3_rentals` WHERE `gs3_rentals`.`user_id` = 1851
---
	def index
		if params[:search_new]
			@users = User.find(:all, :conditions => ['name LIKE ?', "%#{params[:search_new]}%"])
			@label = "New rental for \"#{params[:search_new]}\""
		elsif params[:search]
			@users = User.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])
			@rentals = @users.map{|u| u.rentals}.flatten

SELECT `gs3_users`.* FROM `gs3_users` WHERE `gs3_users`.`id` = 1851 LIMIT 1
---
	def new
		@user = User.find(params[:user_id])

SELECT `gs3_rentals`.* FROM `gs3_rentals` WHERE `gs3_rentals`.`id` = 88 LIMIT 1
SELECT `gs3_rental_items`.* FROM `gs3_rental_items` WHERE `gs3_rental_items`.`id` = 274 LIMIT 1
UPDATE `gs3_rental_items` SET `returned_on` = '2013-07-16 23:52:09', `return_approver_id` = 1851, `return_note` = 'was late', `missing` = 0, `updated_at` = '2013-07-16 23:52:09' WHERE `gs3_rental_items`.`id` = 274
INSERT INTO `gs3_gear_item_notes` (`approver_id`, `created_at`, `gear_item_id`, `note`, `rental_item_id`, `updated_at`) VALUES (1851, '2013-07-16 23:52:09', 797, 'was late', 274, '2013-07-16 23:52:09')
UPDATE `gs3_gear_items` SET `rented` = 0, `updated_at` = '2013-07-16 23:52:09' WHERE `gs3_gear_items`.`id` = 797
---
	def update
		@rental = Rental.find(params[:id])

		if params[:returned] or params[:missing]
			ret = params[:returned]?params[:returned]:{}
			mis = params[:missing]?params[:missing]:{}
			returned = (ret.map{|id,val| id} + mis.map{|id,val| id}).uniq
			returned.each do |id|
				puts params[:returned_note[id]]
				puts params['returned_note']
				rental_item = RentalItem.find(id)
				rental_item.update_attributes(
								:returned_on => Time.now,
								:return_approver_id => params[:approver_id],
								:return_note => params['returned_note'][id],
								:missing => (mis[id] != nil))
				GearItemNote.create! 	:note => params['returned_note'][id],
															:rental_item_id => rental_item.id,
															:gear_item_id => rental_item.gear_item_id,
															:approver_id => params[:approver_id]

				if mis[id]
					rental_item.gear_item.update_attributes(:missing => true)

SELECT `gs3_rentals`.* FROM `gs3_rentals` WHERE `gs3_rentals`.`id` = 88 LIMIT 1
---
	def show
		@rental = Rental.find(params[:id])