app/controllers/users_controller.rb

SELECT `gs3_users`.* FROM `gs3_users` WHERE `gs3_users`.`id` = 1851 LIMIT 1
---
  def index
    if params[:search]
			@users = User.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])

SELECT `gs3_rentals`.* FROM `gs3_rentals` WHERE `gs3_rentals`.`user_id` = 1851
SELECT `gs3_users`.* FROM `gs3_users` WHERE `gs3_users`.`id` = 1851 LIMIT 1
---
  def show
    @user = User.includes(:rentals, :deposit).find(params[:id])